OpenFOAM/foam9tutorials/tutorials/combustion/reactingFoam/Lagrangian/aachenBomb/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          19762;
        startFace       494419;
    }
)

// ************************************************************************* //
