OpenFOAM/foam9tutorials/tutorials/combustion/reactingFoam/Lagrangian/aachenBomb/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-10 0 -10)
    (-10 0 10)
    (10 0 10)
    (10 0 -10)
    (-10 100 -10)
    (-10 100 10)
    (10 100 10)
    (10 100 -10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (41 41 100) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall walls
    (
        (2 6 5 1)
        (0 4 7 3)
        (0 1 5 4)
        (4 5 6 7)
        (7 6 2 3)
        (3 2 1 0)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
